{"sections":{"image_hero_J3q6je":{"type":"image-hero","blocks":{"heading_MjDzFU":{"type":"heading","settings":{"title":"Frequently Asked Questions","heading_font_size":5}}},"block_order":["heading_MjDzFU"],"settings":{"unique_id":"hero-1","enable_full_width":true,"image_height_type":"custom","custom_height_desktop":"250px","custom_height_mobile":"150px","background_image":"shopify:\/\/shop_images\/july-summer.png","background_image_mobile":"shopify:\/\/shop_images\/july-summer.png","background_image_focal_point":"image_presentation","background_image_mobile_focal_point":"image_presentation","media_link":"","content_max_width":500,"text_position":"center_center","text_position_mobile":"center_center","image_overlay_tint_opacity":10,"image_overlay_tint_style":"solid","image_overlay_override_with_custom_colors":false,"image_overlay_override_color_text":"#ffffff","image_overlay_override_color_tint":"#000000","enable_text_box":false,"text_box_style":"soft_small","text_box_color_scheme":"default","text_box_override_with_custom_colors":false,"text_box_override_color_text":"#393939","text_box_override_color_background":"#ffffff","section_style_spacing_top":0,"section_style_spacing_bottom":0,"section_style_enable_animation":true}},"collapsible_row_list_3yNhxF":{"type":"collapsible-row-list","blocks":{"item_X7Pp3f":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Are Frank’s products fresh or frozen?","text":"<p>90% of our products sold online are fresh. They are prepared, stored, and shipped in a temperature regulated environment. All ingredients or animal protein we procure arrive fresh, never frozen.<\/p><p>In fact all of our non-frozen butcher items are prepared specifically for you, fresh-to-order, much like a butcher would at our in-store marketplace.<\/p><p>Once everyone's orders for the week are received, our fully trained and certified butcher diligently prepares your unique cut and within 24 hours it arrives on your doorstep. Now that's fresh!<\/p><p>At our store and online, a fresh and frozen product mix helps us to eliminate food waste and guarantee quality.<\/p>"}},"item_LA4nVP":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Does freezing food effect quality?","text":"<p>The short answer is, it depends. Freezing food is a form of food preservation which been practiced for a very long time all over the globe. It has been and still is crucial to our survival. Freezing method determines the quality of food being frozen.<\/p><p>Faster freezing methods are better than slower methods. Faster freezing methods mitigate the size of ice crystals which unavoidably form within food as its water content freezes.<\/p><p>Slower freezing methods allow larger ice crystals to form which, like the cracks which form in a road surface during seasonal transitions, destroy the cell membranes of the food.<\/p>"}},"item_hdcCp8":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Which freezing method does Frank’s use?","text":"<p>We do not sell anything that does not meet our standards for the highest quality.<\/p><p>Not all freezing methods are created equal. We use industry-leading technology to flash-freeze our products as quickly as possible. This method preserves the highest degree of food integrity. All frozen food, regardless of freezing method, does tend to change colour a bit.<\/p>"}},"item_qqYdWk":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Which products do you freeze and why?","text":"<p>Our ground meat, burgers, and bratwurst sausages are frozen. The production and sales cycles associated with these items require freezing in order to maximize quality and minimize waste.<\/p>"}},"item_WCxCyd":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What are the best defrosting methods?","text":"<p>Opposite to freezing methods, slower defrosting methods are better than faster methods.<\/p><p>Slower defrosting methods allow ice crystals within the food to gradually melt, minimizing damage to cellular structure. This means better texture and more juice. Faster defrosting methods not only compromise quality but also increase the likelihood of bacteria formation.<\/p><p>The most reliable defrosting method is to place your packaged item into the fridge, perhaps on a dish, and allow several hours per pound of meat to thaw. Defrosting in the fridge over night or during the day while you are at work is suitable in most situations.<\/p><p>If you are in a pinch, you can submerge your packaged item into a container of cold water, allowing 30 minutes per pound of material to thaw. Avoid defrosting at room temperature as quality degradation and bacteria concerns are increased.<\/p>"}},"item_ktVwtB":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What are your standards for food quality?","text":"<p>We are proud to provide the finest, freshest organic ingredients available. We are only interested in the best.<\/p><p>In addition to using ingredients grown at our certified organic greenhouse and farm, we are partnered with industry leaders who specialize in organic produce.<\/p><p>All of our animal protein comes from Ontario-based farms who align with our values and invest heavily into quality and animal welfare.<\/p><p>We have taken great measure to personally inspect each partner farm we collaborate with and we have witnessed their excellence with our own eyes.<\/p>"}},"item_HwUjHM":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What is the definition of ‘grass-fed'?","text":"<p>The definition of ‘Grass-fed’ will vary depending on who is using it.<\/p><p>Generally speaking, cattle, bison, and similar species are animals which graze and feed on grass; not grain. Grains are not optimal for, nor a natural part of a cow’s diet. Grains may also be fed to cows in large quantities to help the cow gain weight.<\/p><p>Therefore it is extremely important, for both food quality and animal comfort, that cows and related species are fed grass or something very similar that is part of their natural diet.<\/p><p>Enjoy peace of mind knowing that our beef and bison are free-range, 100% grass-fed, 100% grass-finished. Just like nature intended. Both are sourced from local Ontario farms. The beef is sourced from Meaford and bison from Uxbridge.<\/p>"}},"item_UGQgrA":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What is the definition of ‘grass-finished’?","text":"<p>'grass-finished' typically means the animal spent the remaining duration of its life (usually months) eating grass.<\/p><p>All cattle (or similar animal species) unavoidably begin their lives eating grass. But conventionally raised animals are switched over to grains toward the next stage of their journey.<\/p><p>This unethical tactic is used to induce rapid weight gains. This causes the animal a great deal of discomfort for two main reasons:<\/p><ul><li>Grains are not a natural part of their diet and these animals would never choose to eat grains under normal circumstances. Their bodies are simply not designed to process them<\/li><li>Rapidly gaining weight is also not natural, uncomfortable, and causes biological abnormalities to form<\/li><\/ul><p>Enjoy peace of mind knowing that our beef and bison are free-range, 100% grass-fed, 100% grass-finished. Just like nature intended. Both are sourced from local Ontario farms. The beef is sourced from Meaford and bison from Uxbridge.<\/p>"}},"item_bbdzYk":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What is the definition of 'free-range'?","text":"<p>'Free-range' usually means that the animal is provided with the option to venture outside of its dwelling. This is often confused with 'pasture-raised', which generally means the animal was raised mostly outdoors. To confuse things further, the terms are often interchangeably used. It is important to verify the exact meaning on a case-by-case basis. <span style=\"text-decoration:underline\">All of our animals are free-range.<\/span> Read more below.<\/p><p><\/p><p><strong>Cows: <\/strong>Our beef cattle have a lifespan of at least two years where they spend their time rotationally grazing through pasture, forest and annual cover crops. In the harsh winter season the herd is protected in a naturally lit barn with outdoor access. <\/p><p><strong>Chickens: <\/strong>Chickens dwell in large barns, in groups occupying pens similar to a horse stable. They have a very comfortable degree of personal space and their homes protect them from the elements and predation. Chickens are given the choice to venture outdoors when they please, with the exception of certain weather conditions, in which case there is regulated outdoor access for their safety.<\/p><p> <strong>Pigs<\/strong>: Similar to chickens, pigs enjoy the benefits of a balanced indoor and outdoor lifestyle to guarantee their comfort and safety. They are very social animals that like to feed in groups but also value their personal space, which they receive plenty of. These are some happy pigs!<\/p><p><strong>Bison:<\/strong> Our bison enjoy living outdoors all-year-round. They are free to graze throughout the summer months and fed round bales of hay daily when its cold. Bison are strong and adaptable! Perhaps we could learn a thing or two from these beautiful animals...<\/p>"}}},"block_order":["item_X7Pp3f","item_LA4nVP","item_hdcCp8","item_qqYdWk","item_WCxCyd","item_ktVwtB","item_HwUjHM","item_UGQgrA","item_bbdzYk"],"settings":{"center_content":true,"preheading":"","heading":"Food","heading_font_size":3,"subheading":"","header_position":"above","item_heading_font":"heading","content_width":"custom","custom_width":1000,"color_scheme":"default","override_with_custom_colors":false,"override_color_text":"#393939","override_color_background":"#ffffff","section_style_spacing_top":36,"section_style_spacing_bottom":36,"section_style_enable_animation":true}},"collapsible_row_list_4DjJMm":{"type":"collapsible-row-list","blocks":{"item_QEY7hL":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"How does shipping work?","text":"<p>Presently we offer a flat rate for every order and deliver all orders once per week throughout the GTA. We plan to deliver more frequently and offer lower rates in the future.<\/p><p>Orders placed before Wednesday at 2:00PM EST are prepared on Thursday and delivered Friday, during a 4 hour time frame.<\/p><p>To reduce environmental impacts of shipping, your order is transported in refrigerated vehicles, and does not contain any disposable insulation or refrigerant. <span style=\"text-decoration:underline\">We kindly ask that you or someone you trust plan to be available and receive delivery on Friday<\/span>.<\/p><p><em>Please indicate any special instructions or considerations relevant to your delivery when placing your order and we will do our best to accommodate<\/em><\/p><p>Rates and delivery time frame depends on which zone your order is delivered to.<\/p>"}},"item_Nferqa":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What are your delivery zones, rates, and time frames?","text":"<p>We deliver all orders placed before Wednesday at 2PM every Friday to the most populated areas in the GTA. Delivery rates and time frames vary by zone. <span style=\"text-decoration:underline\">We kindly ask that you plan ahead to ensure you or someone you trust is present to receive your delivery.<\/span><\/p><p>We do not earn any profit on the delivery cost; you pay what we pay.<\/p><p><\/p><ul><li>Zone 1 ($17.99): Etobicoke, Downtown Toronto, North York: Fridays 11:00 AM - 3:00 PM<\/li><li>Zone 2 ($19.99): Scarborough, Markham, Pickering, Ajax, Whitby: Fridays 10:00 AM - 2:00 PM<\/li><li>Zone 3 ($17.99): Aurora, Richmond Hill, Vaughan, Newmarket: Fridays 9:00 AM - 1:00 PM<\/li><li>Zone 4 ($24.99): Mississauga, Oakville, Milton: Fridays 12:00 PM - 4:00 PM <\/li><\/ul>"}},"item_8R3mmn":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"How do I determine whether my address is eligible for shipping?","text":"<p>Every product page on our website contains an expandable form labeled \"Shipping Arrangement\". Please click this form to view a list of eligible delivery zones and towns.<\/p><p>If you are still unsure then you may also follow these steps:<\/p><ol><li>Please add at least one item to your cart<\/li><li>Navigate to the checkout page by clicking the Cart icon (at the top right of your screen) then click Checkout<\/li><li>Enter your delivery information including your address<\/li><\/ol><p>If your address is within our service area you will see your single option for flat rate shipping appear. If no shipping option appears then we do apologize that your delivery address is not within our service area<\/p><p>Please contact support@franksorganicgarden.com if you have any further questions and we will be happy to assist you<\/p>"}},"item_gLNJYp":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What happens once I place my order?","text":"<p>Email confirmation will be sent to the address entered on orders which have been successfully placed and paid for.<\/p><p>On Friday, you will receive the following SMS (text) messages delivered to the number entered on your order. Please avoid using landlines:<\/p><p><\/p><p><span style=\"text-decoration:underline\">START ROUTE NOTIFICATION<\/span><\/p><p>Your order from Frank’s Organic Garden is out for delivery and will arrive today. Please kindly plan your availability to receive your package. Thank you<\/p><p><\/p><p><span style=\"text-decoration:underline\">NEXT IN QUEUE NOTIFICATION<\/span><\/p><p>Your order from Frank’s Organic Garden is next in queue for delivery and will arrive shortly. Thank you<\/p><p><\/p><p><span style=\"text-decoration:underline\">ORDER DELIVERED NOTIFICATION<\/span><\/p><p>Your order from Frank’s Organic Garden has been delivered. We hope you enjoy your purchase and thank you for your support.<\/p>"}},"item_HVHeGe":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What if I am not present to receive my delivery?","text":"<p>Our team has invested tremendously into procuring the finest, freshest food products available for your enjoyment and making sure it arrives to you as fresh as can be.<\/p><p>Accepting your delivery in person is the final step in the long and delicate journey your food ventures from farm to table. It would be regrettable if your food quality suffered because someone was not available to accept your package and transfer its contents into the fridge or freezer.<\/p><p>But life happens, and we get that.<\/p><p>Here are several options and considerations to reduce delivery-anxiety.<\/p><p><\/p><ol><li>Your number one best option is to <em>plan in advance<\/em>. The delivery day (Friday) and delivery time are fixed so you can confidently know when your order will arrive. A little bit of planning goes a long way, so put on that creative-hat and surprise yourself with the great solutions you come up with! But if you seriously cannot be available, then try the following...<\/li><li>Pick an appropriately sized cooler, add ice, and leave it at the delivery area (front door, concierge, etc). Fix a note to the cooler indicating order number. Our delivery driver will place your order, without opening the box, into the cooler - assuming it fits. The air in a cooler requires time to cool down, so add your ice long in advanced, such as the night prior<\/li><li>The last and least preferred option, is to consciously shelter your package from sun and rain. This could be as simple as leaving the package on the balcony, side door or garage. <span style=\"text-decoration:underline\">Please indicate any special instructions for the driver on your order.<\/span><\/li><\/ol>"}},"item_fAPBdB":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What happens if my order remains outside for a long period of time?","text":"<p>We kindly remind customers that being available at home to receive your delivery is extremely important to guarantee the quality of your food products.<\/p><p>If your order contains perishable or fresh items then it is recommended to verify the internal temperature of any product that is not frozen solid and immediately discarding anything that is not at a safe temperature. Products that are refrigerator cold (40 degrees or less), partly frozen (solid), or frozen can be placed into the freezer for later use. You should immediately discard product that is above 40 degrees or product that is exactly 40 degrees that may have been so for more than 2 hours.<\/p>"}},"item_wxYWnn":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What if I live in a condo or gated community?","text":"<p>Please verify your community policy to make sure that perishable products are welcome for delivery if you're not available. If you have specific delivery instructions, please be sure to include these when placing an order. If you are not available, and no instructions were provided, then an effort will be made to leave your package in a secure location<\/p>"}},"item_EmrfcA":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"What if my delivery is delayed due to poor weather conditions?","text":"<p>There may be unexpected delays or cancellations due to poor weather conditions. We make great effort to notify you as soon as possible should your delivery be affected. Safety is prioritized. If a driver cannot complete delivery due to the path to your door being blocked or too icy, the delivery may be reattempted the next day.<\/p>"}},"item_L3x6Q8":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Will my food items stay fresh during delivery?","text":"<p>Freshness is guaranteed. We prepare, store, and ship all items in temperature-regulated environments. At no point is your order exposed to ambient temperatures for more than several minutes while we are handling it. Please make your best effort to be available during the delivery window so you can transfer your order immediately into the fridge or freezer.<\/p>"}}},"block_order":["item_QEY7hL","item_Nferqa","item_8R3mmn","item_gLNJYp","item_HVHeGe","item_fAPBdB","item_wxYWnn","item_EmrfcA","item_L3x6Q8"],"settings":{"center_content":true,"preheading":"","heading":"Shipping","heading_font_size":3,"subheading":"","header_position":"above","item_heading_font":"heading","content_width":"custom","custom_width":1000,"color_scheme":"default","override_with_custom_colors":false,"override_color_text":"#393939","override_color_background":"#ffffff","section_style_spacing_top":36,"section_style_spacing_bottom":36,"section_style_enable_animation":true}},"collapsible_row_list_BtKARk":{"type":"collapsible-row-list","blocks":{"item_QxYDmw":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Who can I contact for questions about my order?","text":"<p>Please contact support@franksorganicgarden.com and we will be happy to help you<\/p>"}},"item_TJBWxf":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"Can I cancel or change my order?","text":"<p>Please contact us immediately at support@franksorganicgarden.com. Please include your order number as well as a phone number which we can reach you at.<\/p><p>We are pleased to accommodate cancellations or changes if the order has not already been prepared for shipping<\/p>"}},"item_9Rcd6Y":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"How does variable weight pricing work?","text":"<p>Certain butcher items are cut fresh for your order. The price and weight displayed on the product page is an estimate. The precise weight and cost is unknown until we prepare the item for you. When you complete an order, your credit card is authorized (not charged) for the estimated amount. Once the item is prepared, you will be charged the final amount. You will only be charged once (the final amount).<\/p>"}},"item_8Nwta6":{"type":"item","settings":{"expand_by_default":false,"icon":"none","title":"I'm unsatisfied with my order. What should I do?","text":"<p>We want to earn your trust and build a long-lasting relationship with you. Therefore, we guarantee your satisfaction and will appreciate the opportunity to demonstrate how highly valued your business is.<\/p><p>Please consider that most of our food products are perishable. Therefore, we cannot accept returns of any kind for these items, opened or unopened, due to the inability to guarantee their integrity. <\/p><p>That does not mean we will not support you in the event you are unsatisfied with your purchase. Sometimes mistakes happen, such as damage during delivery, and expectations are not always met. <\/p><p>Please give us the chance to learn about your issue and allow us to propose a solution that will have you raving about our service to all your friends.<\/p><p>Experience this for yourself by contacting support@franksorganicgarden.com. Please include your order number and a phone number you can be reached at.<\/p><p>Thank you<\/p>"}}},"block_order":["item_QxYDmw","item_TJBWxf","item_9Rcd6Y","item_8Nwta6"],"settings":{"center_content":true,"preheading":"","heading":"Orders","heading_font_size":3,"subheading":"","header_position":"above","item_heading_font":"heading","content_width":"custom","custom_width":1000,"color_scheme":"default","override_with_custom_colors":false,"override_color_text":"#393939","override_color_background":"#ffffff","section_style_spacing_top":36,"section_style_spacing_bottom":36,"section_style_enable_animation":true}}},"order":["image_hero_J3q6je","collapsible_row_list_3yNhxF","collapsible_row_list_4DjJMm","collapsible_row_list_BtKARk"]}