{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"content_width":"full","custom_content_width":700,"section_style_enable_animation":true}},"image_hero_XfrNge":{"type":"image-hero","blocks":{"heading_UcRxYF":{"type":"heading","settings":{"title":"Message from Frank Stronach","heading_font_size":6}},"text_xxb7aH":{"type":"text","settings":{"text":"<p>I’m a great believer in the sayings<\/p><p> \"You are what you eat\"<\/p><p> \"Let food be thy medicine and medicine be thy food\".<\/p>","text_font_size":5}}},"block_order":["heading_UcRxYF","text_xxb7aH"],"settings":{"enable_full_width":false,"image_height_type":"custom","custom_height_desktop":"550px","custom_height_mobile":"450px","background_image":"shopify:\/\/shop_images\/message-from-frank.jpg","background_image_mobile":"shopify:\/\/shop_images\/message-from-frank.jpg","background_image_focal_point":"top","background_image_mobile_focal_point":"top","media_link":"","content_max_width":500,"text_position":"center_center","text_position_mobile":"center_center","image_overlay_tint_opacity":30,"image_overlay_tint_style":"solid","image_overlay_override_with_custom_colors":false,"image_overlay_override_color_text":"#ffffff","image_overlay_override_color_tint":"#000000","enable_text_box":false,"text_box_style":"soft_small","text_box_color_scheme":"default","text_box_override_with_custom_colors":false,"text_box_override_color_text":"#393939","text_box_override_color_background":"#ffffff","section_style_spacing_top":0,"section_style_spacing_bottom":0,"section_style_enable_animation":true}},"collapsible_row_list_wy4cyj":{"type":"collapsible-row-list","blocks":{"item_pd73jQ":{"type":"item","settings":{"expand_by_default":true,"icon":"none","title":"Read Frank's Message","text":"<p>“I’m a great believer in the sayings ‘you are what you eat', and 'let food be thy medicine and medicine be thy food'.<\/p><p>In 2010, I made the decision to go into organic agriculture for the purpose of growing healthy, all-natural foods free from pesticides and other chemicals. <\/p><p>The more I got involved in the agriculture business, the more I could see how the industry has become a huge chemical jungle that impacts our environment, our health and our children. Approximately 95% of the food eaten today comes from large industrial farms. On these industrial farms, you no longer see eagles flying above the fields for the simple reason that there are no longer any rabbits or pheasants or mice on the ground below because of all the chemicals we spray.  <\/p><p>The enormous use of pesticides, herbicides, fungicides, and chemical additives are making people sick and allergic. It’s one of the main reasons why food is now the biggest cause of chronic disease in Canada and the United States.  <\/p><p>When I was growing up, everyone knew where their food came from and how it was made. Everything was grown naturally and every meal used foods that were full of nutrients and vitamins. It was simple and natural. <\/p><p>The fact is, if you’re healthy, you think more clearly. You’re able to work better. And you’re able to get the most out of life, whether it’s building a successful career, playing sports or pursuing leisure activities.   <\/p><p>To be truly healthy, we need to embrace a diet of all-natural, organic foods. That’s why I decided to open Frank’s Organic Garden Restaurant and Marketplace, where we only serve and sell the finest and freshest organic foods. <\/p><p>At Frank’s Organic Garden, our recipes incorporate organic produce grown at our organic farm and greenhouse in the nearby countryside. All our meat is organic, free-range, GMO-free, hormone-free, and free from antibiotics. And all our meats are sourced from animals that live and roam freely on fields and pastures with fresh air, clean water, and daylight. <\/p><p>Over the years, I’ve eaten in the best restaurants in New York, Los Angeles, Paris, and Vienna, so I think I’m a fairly good judge of quality. I taste every recipe before it goes on our menu. If it’s not a wow, we won’t have it on the menu. And if it doesn’t have great nutritional value, we won’t put it on the menu either. <\/p><p>It is my sincere hope that people of all ages will embrace a healthy organic lifestyle so they can feel their best and reach their full potential.\"<\/p><p>- Frank Stronach<\/p>"}}},"block_order":["item_pd73jQ"],"settings":{"center_content":true,"preheading":"","heading":"","heading_font_size":3,"subheading":"","header_position":"above","item_heading_font":"heading","content_width":"custom","custom_width":1000,"color_scheme":"default","override_with_custom_colors":false,"override_color_text":"#393939","override_color_background":"#ffffff","section_style_spacing_top":36,"section_style_spacing_bottom":36,"section_style_enable_animation":true}}},"order":["main","image_hero_XfrNge","collapsible_row_list_wy4cyj"]}