{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"content_width":"full","custom_content_width":700,"section_style_enable_animation":true}},"image_hero_CgiCGQ":{"type":"image-hero","blocks":{"heading_gAqa9a":{"type":"heading","settings":{"title":"Organic Restaurant","heading_font_size":6}},"text_WLBFPF":{"type":"text","settings":{"text":"<p>Our restaurant can be described as casual fine dining and our philosophy is quality over quantity<\/p>","text_font_size":5}}},"block_order":["heading_gAqa9a","text_WLBFPF"],"settings":{"enable_full_width":false,"image_height_type":"custom","custom_height_desktop":"550px","custom_height_mobile":"50vh","background_image":"shopify:\/\/shop_images\/restaurant-alternate-2500x2500.jpg","background_image_focal_point":"image_presentation","background_image_mobile_focal_point":"image_presentation","media_link":"","content_max_width":500,"text_position":"center_center","text_position_mobile":"center_center","image_overlay_tint_opacity":30,"image_overlay_tint_style":"solid","image_overlay_override_with_custom_colors":false,"image_overlay_override_color_text":"#ffffff","image_overlay_override_color_tint":"#000000","enable_text_box":false,"text_box_style":"soft_small","text_box_color_scheme":"default","text_box_override_with_custom_colors":false,"text_box_override_color_text":"#393939","text_box_override_color_background":"#ffffff","section_style_spacing_top":0,"section_style_spacing_bottom":0,"section_style_enable_animation":true}},"collapsible_row_list_G8R7cb":{"type":"collapsible-row-list","blocks":{"item_diqVkh":{"type":"item","settings":{"expand_by_default":true,"icon":"none","title":"Organic Restaurant","text":"<p>Our restaurant and marketplace is located in Aurora, Ontario. Here you will experience casual fine dining and a European-style market. Both embrace an all-natural, organic approach to eating with many gluten-free and vegan options. Everything you eat in the restaurant, all ingredients, are available in the marketplace for you to purchase; including produce from our farm. <\/p><p>Our restaurant can be described as casual fine dining. Our philosophy is quality over quantity and we’ve consciously created a menu using decades of world class dining experience to serve highly nutritious, great tasting meals for all diets.  <\/p><p>We are proud to offer the finest, fresh organic foods in our restaurant and marketplace which are free from preservatives, chemicals, and artificial additives. Animal protein and dairy is sourced from organic farms where animals live in greater peace and harmony with their natural environment; fully liberated from antibiotics, hormones, and GMOs. We also grow much of our produce locally at our farm and certified organic greenhouse.  <\/p><p>Frank tastes every recipe before its added to our menu to ensure everything we serve is exceptionally tasty and nutritious.  <\/p><p>In addition, a catalogue of Frank’s favourite wines are on offer to delight and expand your palette. Our experienced bar tenders also serve a range of established and upcoming classic drinks for all preferences and occasions. <\/p><p>Excellent food and drink demand equally high-calibre staff. We’re truly grateful for our amazing restaurant team who help create a safe, supportive, and fun culture. They’re positive, courteous, considerate, and dedicated to making every visit special. Their extensive understanding of our organization, menu, and products will inspire you as you join us on this journey.  <\/p><p>Another absolutely vital component of the restaurant is our kitchen staff. This team works tirelessly, before, during and after opening hours, to guarantee operational excellence. <\/p><p>Like a Swiss timepiece, they do not miss a beat even under demanding circumstances. Our kitchen is recognized for its cleanliness, protocol, and adherence to best practices. <\/p><p>To this end, we express our sincere gratitude to our customers, staff, and Frank for collectively creating a truly unique movement that’s making a difference in the lives of others.<\/p>"}}},"block_order":["item_diqVkh"],"settings":{"center_content":true,"preheading":"","heading":"","heading_font_size":2,"subheading":"","header_position":"above","item_heading_font":"heading","content_width":"custom","custom_width":1000,"color_scheme":"default","override_with_custom_colors":false,"override_color_text":"#393939","override_color_background":"#ffffff","section_style_spacing_top":36,"section_style_spacing_bottom":36,"section_style_enable_animation":true}}},"order":["main","image_hero_CgiCGQ","collapsible_row_list_G8R7cb"]}